Documents/Renault_ИзменитьПриоритетПродажАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ИзменитьПриоритетПродажАвтомобиля</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_ПриоритетыПродажАвтомобилей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриоритетыАвтомобилей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйПриоритет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ПриоритетыПродажАвтомобилей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтарыйПриоритет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ПриоритетыПродажАвтомобилей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_ПриоритетыПродажАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПриоритетыПродажАвтомобилей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ПриоритетыПродажАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Renault_ИзменитьПриоритетПродажАвтомобиля/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.Renault_ПриоритетыПродажАвтомобилей.Записывать = Истина;
	Движения.Renault_ПриоритетыПродажАвтомобилей.Очистить();
	
	Для Каждого Стр Из ПриоритетыАвтомобилей Цикл
		Движение = Движения.Renault_ПриоритетыПродажАвтомобилей.Добавить();
		Движение.Период = Дата;
		Движение.Автомобиль = Стр.Автомобиль;
		Движение.Приоритет = Стр.НовыйПриоритет;
	КонецЦикла;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Автор = ПараметрыСеанса.Пользователь;
	
	Для Каждого Стр Из ПриоритетыАвтомобилей Цикл
		Стр.СтарыйПриоритет = ПолучитьСтарыйПриоритет(Стр.Автомобиль, ТекущаяДата());
		Стр.НовыйПриоритет = Справочники.Renault_ПриоритетыПродажАвтомобилей.ПустаяСсылка();
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьСтарыйПриоритет(Автомобиль, ДатаПолучения) Экспорт
	Значение = Справочники.Renault_ПриоритетыПродажАвтомобилей.ПустаяСсылка();

	Если НЕ ЗначениеЗаполнено(Автомобиль) Тогда
		Возврат Значение;
	КонецЕсли; 	
		
	Граница = Новый Граница(ДатаПолучения, ВидГраницы.Исключая);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПриоритетыПродажАвтомобилейСрезПоследних.Приоритет КАК Приоритет
		|ИЗ
		|	РегистрСведений.Renault_ПриоритетыПродажАвтомобилей.СрезПоследних(&Граница, Автомобиль = &Автомобиль) КАК Renault_ПриоритетыПродажАвтомобилейСрезПоследних";
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль); 
	Запрос.УстановитьПараметр("Граница", Граница);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Значение = Выборка.Приоритет; 
	КонецЕсли;  
	
	Возврат Значение;	
КонецФункции
